Repository: inammuhammad/nrlp-ios
Catalog: NRLP/Resources/*.lproj/Localizable.strings
Languages: ur

source: Dear Customer, Thank you for providing information, you will be notified soon with the verification status via SMS
ur: معزز صارف معلومات فراہم کرنے کے لئے آپ کا شکریہ، آپ کو جلد ایس ایم ایس کے ذریع تصدیق کے متعلق -آگاہ کر دیا جائے گا

source: About
ur: معلومات

source: Benefits
ur: فوائد

source: Complaints
ur: شکایت

source: Thank you for registering as a Beneficiary for Sohni Dharti Remittance Program.
ur: سوہنی دھرتی ریمیٹنس پروگرام رجسٹر کرنے کا شکریہ۔

source: Thank you for registering as a Remitter for Sohni Dharti Remittance Program.
ur: سوہنی دھرتی ریمیٹنس پروگرام رجسٹر کرنے کا شکریہ۔

source: Please select your Residence Country
ur: اپنے رہائشی ملک کا انتخاب کریں۔

source: Registration Code *
ur: * رجسٹریشن کوڈ

source: Complaint Management
ur: شکایت کی منتظمی

source: Complaint Type
ur: شکایت کی قسم

source: Unable to register
ur: رجسٹر نہیں کر سکا

source: Unable to receive OTP
ur: او ٹی پی وصول نہیں ہوا

source: Unable to receive Registration Code
ur: رجسٹریشن کوڈد وصول نہیں ہوا

source: Others
ur: دیگر

source: Specify Details
ur: تفصیلات بتائیں

source: Mobile Operator Name
ur: موبائل آپریٹر کا نام

source: Unable to add beneficiary
ur: وصول کنندہ کو شامل کرنے سے قاصر

source: Unable to transfer points to beneficiary
ur: پوانٹس منتقل کرنے سے قاصر

source: Unable to self award points
ur: خود ایوارڈ دینے سے قاصر

source: Redemption Issues
ur: پوائنٹ استمال کرنے سے قاصر

source: Redemption Partner
ur: ریڈیمشن پاٹنر

source: Dear Customer, Your complaint has been logged please note the Tracking number
ur: معزز صارف, اپ کی شکائت درج کرلی گئ ہے براہ کرم ٹریکنگ نمبر نوٹ کریں۔

source: Your issue will be resolved within 5 working days. In case complaint remains unresolved, you may contact us at sdrpsupport@1link.net.pk or 111-116-757
ur: مسئلہ 5 کاروباری دنوں میں حل ہو جائے گا، اگر شکایت حل نہیں ہوئی تو آپ sdrpsupport@1link.net.pk یا 757-116-111 پر رابطہ کرسکتے ہیں

source: Transaction Type
ur: ٹرانزیکشن کی قسم

source: Profile Change
ur: پروفائل کی تبدیلی

source: Self Awarding
ur: سیلف ایوارڈ

source: Redemption
ur: ریڈیمشن

source: Beneficiary CNIC/NICOP
ur: CNIC/NICOP وصول کنندہ کا

source: Beneficiary Country of Residence
ur: وصول کنندہ کے قیام کا ملک

source: Beneficiary Mobile Number
ur: وصول کنندہ کا موبائل نمبر

source: Beneficiary Mobile Operator Name
ur: وصول کنندہ کے موبائل آپریٹر کا نام

source: Remitting Entity
ur: ترسیلات زر کا ادارہ

source: Transaction ID
ur: ٹرانزیکشن آئی ڈی

source: Transaction Date
ur: ٹرانزیکشن کی تاریخ

source: Transaction Amount (PKR)
ur: ٹرانزیکشن کی رقم( پاکستانی روپے)

source: Beneficiary details have been updated successfully
ur: وصول کنندہ کی تفصیلات کو کامیابی سے اپ ڈیٹ کر دیا گیا ہے

source: Registration code has been resent
ur: رجسٹریشن کوڈ دوبارہ بھیج دیا گیا ہے

source: Resend Registration Code
ur: رجسٹریشن کوڈ دوبارہ بھیجیں

source: Click Next to add your Remittance Receiver & get auto points into your account
ur: اپنے وصول کنندہ کو شامل کرنے اور اپنے اکاؤنٹ میں آٹو پوائنٹس حاصل کرنے کے لیے اگلے پر کلک کریں

source: Skip
ur: چھوڑ دو

source: + Add Receiver
ur: وصول کنندہ شامل کریں +

source: Remittance Receiver Management
ur: ترسیلات زر وصول کنندہ کی منتظمی

source: Bank Name *
ur: * بینک کا نام

source: Bank Name
ur: بینک کا نام

source: Bank Account Number/IBAN *
ur: * بینک اکاؤنٹ نمبر /بین الاقوامی بینک اکاؤنٹ نمبر

source: Bank Account Number/IBAN
ur: بینک اکاؤنٹ نمبر /بین الاقوامی بینک اکاؤنٹ نمبر

source: Please enter Receiver Name as per CNIC/NICOP
ur: کے مطابق درج کریں NICOP/ CNIC براہ کرم وصول کنندہ کا نام

source: Please enter Receiver Name as per CNIC/NICOP/POC
ur: کے مطابق درج کریں NICOP/ CNIC/ POC براہ کرم وصول کنندہ کا نام

source: Please enter Receiver Bank Account Number/IBAN
ur: براہ کرم وصول کنندہ کا بینک اکاؤنٹ نمبر/بین الاقوامی بینک اکاؤنٹ نمبر درج کریں

source: Please enter Receiver Bank Name
ur: براہ کرم وصول کنندہ کے بینک کا نام درج کریں۔

source: Please enter Receiver Place of Birth as per NADRA record
ur: نادرا کے ریکارڈ کے مطابق براہ کرم وصول کنندہ کی جائے پیدائش درج کریں۔

source: Please enter Receiver Mother Name as per NADRA record
ur: براہ کرم نادرا کے ریکارڈ کے مطابق وصول کنندہ کی والدہ کا نام درج کریں

source: Are you sure want to delete the Receiver?
ur: کیا آپ واقعی وصول کنندہ کو نکلنا چاہتے ہیں

source: Your Remittance Receiver will be added upon NADRA verification
ur: آپ کی ترسیلات زر وصول کرنے والا نادرا کی تصدیق کے بعد شامل کر دیا جائے گا۔

source: Select Receiver Type
ur: وصول کنندہ کی قسم منتخب کریں۔

source: Receiver Type
ur: وصول کنندہ کی قسم

source: Remittance sent to CNIC
ur: قومی شناختی کارڈ پر بھیجی گئی ترسیلات

source: Remittance sent to Bank Account
ur: بینک اکاؤنٹ میں بھیجی گئی ترسیلات

source: Note: You can add maximum 5 receivers.
ur: نوٹ: آپ 5 وصول کنندگان کو شامل کر سکتے ہیں

source: Please enter Receiver Information
ur: براہ کرم وصول کنندہ کی معلومات درج کریں

source: Add Receiver
ur: وصول کنندہ شامل کریں

# USDtext
source: The Annual Remittance to-date in USD is accumulated from 1st July of each year, however for current year it shall be applicable from 1st October 2021 and your loyalty category will be calculated accordingly. For further details please visit FAQs
ur: USD میں سالانہ ترسیلات زر ہر سال یکم جولائی سے جمع ہوتی ہیں تاہم موجودہ سال کے لیے اس کا اطلاق یکم اکتوبر 2021 سے ہوگا اور اسی کے مطابق آپ کی لائلٹی کیٹیگری کا حساب لگایا جائے گا۔

source: 1. For self- awarding of points, please wait for 3 working days after your remittance is credited in the account or received by your beneficiary. 2. RDA customers shall only be eligible for auto awarding of points against the amount which is consumed locally and cannot be repatriated.
ur: ۱۔ پوائنٹس خود دینے کے لیے، براہ کرم 3 کاروباری دنوں تک انتظار کریں جب آپ کی رقم اکاؤنٹ میں جمع ہو جائے یا آپ کے وصول کنندہ کو موصول ہو جائے۔ ۲۔ RDA کسٹمر صرف اس رقم کے بدلے آٹو ایوارڈنگ پوائنٹس کا اہل ہو گا جو مقامی طور پر استعمال ہوتی ہے اور اسے واپس نہیں لایا جا سکتا

source: Beneficiary Relation Type *
ur: وصول کنندہ کا رشتہ منتخب کریں *

source: Beneficiary Relation *
ur: وصول کنندہ کا رشتہ *

source: CNIC/ NICOP *
ur: شناختی کارڈ/ نیشنل آئیڈنٹٹی کارڈ فور اوورسیز پاکستانی *

source: Beneficiary Mobile Number *
ur: وصول کنندہ کا موبائل نمبر *

source: Good
ur: اچھا

source: Satisfactory
ur: تسلی بخش

source: Unsatisfactory
ur: غیر اطمینان بخش

source: Father Name *
ur: والد کا نام *

source: Please enter a valid Account Number/IBAN
ur: براہ کرم صحیح اکاؤنٹ نمبر/ بین الاقوامی بینک اکاؤنٹ نمبر درج کریں

source: Remittance Transaction Type
ur: ترسیلات زر کی قسم

source: Beneficiary CNIC
ur: وصول کنندہ کا قومی شناختی کارڈ نمبر

source: Beneficiary Account Number/ IBAN
ur: وصول کنندہ کا اکاونٹ نمر/ بین الاقوامی بینک اکاؤنٹ نمبر
