Repository: inammuhammad/nrlp-ios
Catalog: NRLP/Resources/*.lproj/Localizable.strings
Languages: ur

source: Forgot Password
ur: پاس ورڈ یاد نہیں

source: Register
ur: رجسٹر کریں

source: Select User Type
ur: یوزر کی قسم منتخب کریں

# CNIC/NICOP Number
source: CNIC/NICOP/POC Number
ur: شناختی کارڈ/ نیشنل آئیڈنٹٹی کارڈ فور اوورسیز پاکستانی نمبر

source: Password
ur: پاس ورڈ

# National Remittance Loyalty Program
source: Sohni Dharti Remittance Program
ur: سوہنی دھرتی ریمیٹنس پروگرام

source: Don't have an account?
ur: کیا آپ کا اکاؤنٹ نہیں ہے؟

source: Remitter
ur: بھیجنے والا

source: Beneficiary
ur: وصول کنندہ

source: Login
ur: لاگ ان کریں

# About NRLP
source: About Sohni Dharti Remittance Program
ur: ‎ سوہنی دھرتی ریمیٹنس پروگرام کے بارے میں جانیں

source: Forgot Password/Unlock Account
ur: پاس ورڈ بھول گئے/اکاؤنٹ ان لاک کریں۔

source: Beneficiary Verification
ur: وصول کنندہ کی توثیق

source: Enter your most recent Remittance Transaction Reference/TT Number (transactions from last one year are eligible, starting 1st Oct 2021)
ur: اپنا حالیہ ترسیلات زر کا حوالہ نمبر درج کریں (1 اکتوبر 2021 کے بعد سے ایک سال پرانی ٹرانزیکشنز استعمال کی جا سکتی ہیں)

# Reference Number
source: Reference Number/TT Number
ur: حوالہ نمبر

source: Transaction Amount
ur: ترسیل کی رقم

source: Remitter Verification
ur: بھیجنے والے کی توثیق

source: No Beneficiary found.
ur: کوئی وصول کنندہ نہیں ملا۔

# Add up to 03 Beneficiaries to transfer and share NRLP Points with them
source: Add a Beneficiary to transfer and share Loyalty Points with them
ur: پوائنٹس کی منتقلی کے لئے وصول کنندہ شامل کریں

source: Beneficiary Details
ur: وصول کنندہ کی تفصیلات

source: Delete Beneficiary
ur: وصول کنندہ کو حذف کریں

source: Are you sure you want to delete
ur: کیا آپ واقعی حذف کرنا چاہتے ہیں؟

source: Are you sure you want to delete %@ ?
ur: کیا آپ واقعی %@ کو حذف کرنا چاہتے ہیں؟

source: Create Beneficiary
ur: وصول کنندہ بنائیں

source: Beneficiary registered successfully.
ur: وصول کنندہ کامیابی کے ساتھ اندراج ہو گیا

source: No beneficiary found
ur: کوئی وصول کنندہ نہیں ملا

source: Select Beneficiary
ur: وصول کنندہ کو منتخب کریں

source: Select Option
ur: آپشن منتخب کریں

source: Transfer
ur: منتقلی

source: Name
ur: نام

source: Transfer Points
ur: پوائنٹس کی منتقلی

source: You have successfully transferred
ur: آپ نے کامیابی کے ساتھ

source: to
ur: کو

source: Version
ur: ورژن

source: Profile
ur: پروفائل

source: FAQs
ur: مقرر پوچھے گئے سوالات

source: Select Redemption Partner
ur: پوائنٹس استعمال کرنے کیلئے پارٹنر کا انتخاب کریں

source: You do not have enough Loyalty Points.
ur: آپ کے پاس خاطر خواہ پوائنٹس نہیں ہیں۔

source: You have selected to redeem %1$@ points for %2$@ at %3$@
ur: آپ نے %2$@ کے لئے %3$@ پر %1$@ پوائنٹس کو استعمال کرنا منتخب کیا ہے

source: You have redeemed %1$@ points at %2$@ on %3$@
ur: آپ نے %3$@ کو %2$@ پر %1$@ پوائنٹس استعمال کر لیے ہیں

source: Redeem Points
ur: پوائنٹس استعمال کریں

source: Enter Points
ur: پوائنٹس درج کریں

source: Select Redemption Service at %@
ur: پوائنٹس استعمال کرنے کیلئے %@ کی سروس کا انتخاب کریں

source: Redeem
ur: استعمال کریں

source: points
ur: پوائنٹس

source: We have sent you a new OTP on your registered mobile no.
ur: ہم نے آپ کو رجسٹرڈ موبائل نمبر پر ایک نیا او ٹی پی بھیجا ہے

source: OTP Verification
ur: او ٹی پی تصدیق

source: Enter Code
ur: کوڈ درج کریں

source: Session will expire in
ur: سیشن کی میعاد ______ میں ختم ہوجائے گی

source: Agent Confirmation
ur: ایجنٹ کی تصدیق

source: Enter Old Password
ur: پرانا پاس ورڈ درج کریں

source: Enter New Password
ur: نیا پاس ورڈ درج کریں

source: Re-enter New Password
ur: نیا پاس ورڈ دوبارہ درج کریں

source: Save
ur: محفوظ کریں

source: Change Password
ur: پاس ورڈ تبدیل کریں

source: Generate Advance Statement
ur: ایڈوانس اسٹیٹمنٹ تیار کریں

source: Email Address
ur: ای میل ایڈریس

source: From Date
ur: اس تاریخ سے

source: Select Date
ur: تاریخ منتخب کریں

source: Request Statement
ur: اسٹیٹمنٹ کی درخواست کریں

source: Advance Loyalty Statement
ur: تفصیلی اسٹیٹمنٹ

source: Last 10 Statements
ur: آخری دس ٹرانزیکشنز

source: Advance Statement
ur: مزید ٹرانزیکشنز ملاحظہ کریں

source: Loyalty Statement
ur: لوائلٹی اسٹیٹمنٹ

source: Send Code
ur: کوڈ بھیجیں

# Enter CNIC/NICOP
source: Enter CNIC/NICOP/POC
ur: CNIC/NICOP/POC کا اندراج کریں

source: User Type
ur: یوزر کی اقسام

source: Select account
ur: یوزر منتخب کریں

source: Please enter your registered CNIC/NICOP/POC
ur: برائے مہربانی اپنا رجسٹرڈ CNIC/NICOP/POC درج کریں

source: OTP Code will expire in
ur: او ٹی پی کوڈ کی میعاد ختم ہونے کا وَقت

source: Code will expire in
ur: کوڈ کی میعاد ختم ہونے کا وَقت

source: Didn't receive the OTP?
ur: کیا آپ کو او ٹی پی موصول نہیں ہوا؟

source: Resend OTP
ur: کوڈ دوبارہ بھیجیں

source: Verify
ur: تصدیق کریں

source: New Password
ur: نیا پاسورڈ

source: Re - Enter New Password
ur: نئے پاسورڈ کا دوبارہ اندراج کریں

source: Confirm
ur: تصدیق کریں

source: Registration Successful
ur: رجسٹریشن کامیاب ہوگئ

source: Update Successful
ur: تبدیلی کامیاب ہوگئ

source: Change Password Successful
ur: پاسورڈ کامیابی سے تبدیل کر دیا گیا ہے

source: Statement Generated Successful
ur: اسٹیٹمنٹ کامیابی سے جاری ہو گئ ہے

source: Redeemed Successfully
ur: پوائنٹس کامیابی سے استعمال ہو گئے ہیں

source: Thank you for registering. You can now enjoy exciting benefits and rewards!
ur: آپ کی رجسٹریشن کا شکریہ۔ اب آپ بہترین فوائد حاصل کر سکتے ہیں

source: Thankyou for registering, Your account will be activated within 5 working days upon successful verification of your provided details
ur: رجسٹر کرنے کے لیے آپ کا شکریہ، آپ کی فراہم کردہ تفصیلات کی کامیاب تصدیق کے بعد آپ کا اکاؤنٹ 5 کاروباری دنوں کے اندر فعال ہو جائے گا۔

source: You have successfully updated your password.
ur: پاسورڈ کامیابی سے تبدیل کر دیا گیا ہے

source: You have registered a New Password. Please go to the login screen and log in with your new password.
ur: آپ نے نئے پاسورڈ کا انتخاب کیا ہے۔برائے مہربانی لاگن اسکرین پہ جا کے اپنے نئے پاسورڈ کے ساتھ لاگن کریں

source: Your request for Statement has been generated. The statement will be emailed to you on the email address provided in 3 to 5 working days.
ur: اپکی درخواست براے لوائلٹی اسٹیٹمنٹ تیار کر دی گییء ہے. يہ اسٹیٹمنٹ آپ کے فراہم کردہ ای میل پتے پر ۳ سے ۵ کاروباری دنوں میں ارسال کی جاے گی

source: Go to Login
ur: لاگ ان پر جائیں

source: Done
ur: مکمل

source: Dashboard
ur: ڈیش بورڈ

source: Logout
ur: لاگ آوٹ

source: Yes
ur: ہاں

source: No
ur: نہیں

source: Welcome,
ur: خوش آمدید

source: Loyalty points
ur: لوائلٹی پوائنٹس

source: Beneficiaries
ur: وصول کنندہ

source: Loyalty Statements
ur: لوائلٹی اسٹیٹمنٹ

source: Home
ur: گھر

source: Next
ur: اگلا

source: Verify your device
ur: اپنے ڈیوائس کی تصدیق کریں

source: We have sent you OTP on your registered mobile number, please enter the OTP below
ur: ہم نے رجسٹرڈ فون نمبر پر آپ کو ایک کوڈ بھیجا ہے۔ براہ کرم نیچے کوڈ درج کریں

source: I agree to the Terms & Conditions
ur: میں شرائط و ضوابط سے متفق ہوں

source: Cancel
ur: منسوخ

source: Terms & Conditions
ur: شرائط و ضوابط

source: Cancel Registration
ur: رجسٹریشن منسوخ کریں

source: Are you sure you want to cancel the registration process?
ur: کیا اپ یقینی طور پر رجسٹریشن منسوخ کرنا چاہتے ہیں

source: Select Country
ur: ملک منتخب کریں

# Full Name
source: Full Name as per CNIC/NICOP/POC
ur: کے مطابق پورا نام CNIC/NICOP

source: Country of Residence
ur: قیام کا ملک

source: Email Address (Optional)
ur: ای میل ایڈریس (اختیاری)

source: Re - Enter Password
ur: پاس ورڈ دوبارہ درج کریں

source: Register an account
ur: رجسٹر کریں

source: Enter a valid name
ur: درست نام درج کریں

# Enter a valid CNIC/NICOP Number
source: Enter a valid CNIC/NICOP/POC Number
ur: درست CNIC / NICOP نمبر درج کریں

source: Select a Country
ur: ملک منتخب کریں

source: Please enter valid Mobile No
ur: براہ کرم درست موبائل نمبر درج کریں

source: Enter a valid email address
ur: درست ای میل کا اندراج کریں

# We have sent you a code on your phone number %@
source: We have sent you OTP on your phone number %@
ur: ‎ کوڈ اپ کے موبائل نمبر %@ پربھیجا گیا ہے

source: Old password is not correct
ur: پرانا پاس ورڈ درست نہیں ہے

source: Password criteria does not match
ur: پاس ورڈ کا معیار مماثل نہیں ہے

source: Both passwords do not match
ur: دونوں پاس ورڈ مماثل نہیں ہیں

source: Enter a valid amount
ur: درست رقم کا اندراج کریں

source: Enter a valid to Date
ur: درست تاریخ انتہا درج کریں

source: Enter a valid from Date
ur: درست تاریخ ابتدا درج کریں

source: To date can't be greater than from date
ur: تاریخ انتہا, تاریخ ابتدا سے آگے نہیں ہو سکتی

source: Enter valid Loyalty Points Amount
ur: درست لائلٹی پوائنٹس درج کریں

source: Something unexpected happened. Please try again
ur: کچھ غیر متوقع طور پر ہوا۔ برائے مہربانی دوبارہ کوشش کریں

source: You don't have enough points to transfer
ur: آپ کی منتقلی کے لئے کافی پوائنٹس نہیں ہیں

source: No internet connection found. Please check your connection settings.
ur: انٹرنیٹ کنکشن نہیں ملا۔ براہ کرم اپنے کنکشن کی ترتیبات کو چیک کریں

source: Connection Failed
ur: رابطہ ناکام

source: Your session has been expired kindly relogin to avail our service
ur: آپ کے سیشن کی میعاد ختم ہوگئی ہے۔ سروس سے فائدہ اٹھانے کے لئے دوبارہ لاگ ان کریں

source: Update Mobile Number
ur: موبائل نمبر تبدیل کریں

source: Mobile Number
ur: موبائل نمبر

source: Are you sure you want to update your mobile number?
ur: کیا آپ واقعی اپنا موبائل نمبر تبدیل کرنا چاہتے ہیں؟

source: Please enter the OTP received at your updated mobile number
ur: براہ کرم اپنے تبدیل شدہ موبائل نمبر پر موصولہ او ٹی پی درج کریں

source: You have successfully updated your mobile number.
ur: آپ نے اپنا موبائل نمبر کامیابی کے ساتھ تبدیل کردیا ہے۔

source: To Date
ur: اس تاریخ تک

source: Bronze
ur: سبز

source: Silver
ur: چاندی

source: Gold
ur: سونا

source: Platimun
ur: پلاٹینم

source: Let’s keep in touch
ur: رابطے میں رہیں

source: Call Us
ur: ہمیں کال کریں

source: Send us an email
ur: ہمیں ای میل بھیجیں

source: Visit our website
ur: ہماری ویب سائٹ پر جائیں

source: Please request the agent to input their 6 digit redemption code
ur: براہ کرم ایجنٹ کو ان کے 6 ہندسوں کے کوڈ کو درج کرنے کی درخواست کریں

# We have sent you a code on your Mobile number %@. Please enter the code below.
source: We have sent you OTP on your Mobile number %@. Please enter the code below.
ur: ہم نے آپ کے موبائل نمبر %@ پر ایک کوڈ بھیجا ہے. برائے مہربانی نیچے کوڈ کا اندراج کریں.

source: Please enter the code below.
ur: برائے مہربانی نیچے کوڈ کا اندراج کریں

source: Your password must contain at least 8 characters, including 1 small letter, 1 capital letter, 1 number and 1 special character.
ur: آپ کا پاس ورڈ کم از ام 8 حروف پر مشتمل ہونا چاہئے، جس میں 1 چھوٹے خط کا حرف، 1 بڑے خط کا حرف ، 1 نمبر اور 1 خصوصی حرف شامل ہو

source: Add Beneficiary
ur: وصول کنندہ شامل کریں

source: You have successfully updated your profile.
ur: آپ نے کامیابی سے اپنی پروفائل اپ ڈیٹ کر دی ہے

source: Device Change
ur: ڈیوائس میں تبدیلی

source: Device Verified
ur: ڈیوائس کی تصدیق ہوگئی

source: Device verified successfully. You will be redirected to Login screen. Please login again.
ur: ڈیوائس کامیابی کے ساتھ تصدیق ہوگئی۔ آپ کو لاگ ان اسکرین پر ری ڈائریکٹ کیا جائے گا۔ براہ کرم دوبارہ لاگ ان کریں۔

source: Okay
ur: ٹھیک ہے

source: Manage Beneficiary
ur: وصول کنندہ کی منتظمی

source: View Statement
ur: اسٹیٹمنٹ دیکھیں

source: Contact Us
ur: رابطہ کریں

source: Active
ur: فعال

source: Pending
ur: زیر التواء

source: Application has monitored a change in language, continuing with it will restart the application. Do you want to continue?
ur: ایپلکیشن نے زبان میں تبدیلی جانچی ہے ، اس پر منتقل ہونے سے ایپلکیشن دوبارہ شروع ہوجائے گی۔ کیا آپ جاری رکھنا چاہتے ہیں؟

source: Are you sure you want to transfer
ur: کیا آپ کا پوائنٹس منتقل کرنے کا فیصلا حتمی ہے؟

source: Points to
ur: پوائنٹس

# View NRLP Benefits
source: View Benefits
ur: سوہنی دھرتی کے فوائد ملاحظہ کریں

source: This feature is coming very soon
ur: یہ خصوصیت بہت جلد آنے والی ہے

source: Coming Soon
ur: جلد آرہا ہے

source: Beneficiary Added
ur: وصول کنندہ شامل ہوا

# NRLP Redemption Partners
source: Sohni Dharti Redemption Partners
ur: سوہنی دھرتی پروگرام کے پارٹنر

# Benefits for NRLP users
source: Benefits for users
ur: سوہنی دھرتی یوزر کے فوائد

source: Redemption Partners
ur: پوائنٹس استعمال کرنے کیلئے پارٹنر کا انتخاب کریں

source: List of Benefits
ur: فوائد کی فہرست

source: Unique ID *
ur: منفرد آئی ڈی *

source: Unique ID
ur: منفرد آئی ڈی

source: Please enter your Full Name as per CNIC/NICOP
ur: براہ مہربانی شناختی کارڈ پر درج شناخت کا نمبر داخل کریں

source: Please enter your Full Name as per CNIC/NICOP/POC
ur: براہ مہربانی شناختی کارڈ پر درج نام داخل کریں

source: Please enter the unique ID you use for sending remittance to Pakistan through your bank or Money Transfer agent, including any ID provided by your country of residence (Iqama No, Registration No., Emirati ID, Driving License, etc.)
ur: اپنا منفرد شناخت کا نمبر درج کریں جو آپ رقوم کی ترسیل کے لئے استعمال کرتے ہوں، بشمول آپ کے رہائشی حکومت کی طرف سے جاری کردہ نمبر (مثلا؛ اقامہ نمبر، رجسٹریشن نمبر، عماراتی آئی ڈی، ڈرائیونگ لائسنس، پاسپورٹ نمبر، وغیرہ)

source: Passport Type *
ur: پاسپورٹ کی قسم *

source: Select Passport Type
ur: اپنے پاسپورٹ کے قسم کا انتخاب کریں

source: Please select your passport type
ur: براہ مہربانی اپنے پاسپورٹ کے قسم کا انتخاب کریں

source: Enter Passport Number *
ur: اپنا پاسپورٹ نمبر درج کریں*

source: Passport No. *
ur: پاسپورٹ نمبر *

source: Passport Number
ur: پاسپورٹ نمبر

source: Enter Passport No.
ur: پاسپورٹ نمبر درج کریں

source: Please enter your passport number
ur: براہ مہربانی اپنا پاسپورٹ نمبر درج کریں

source: Please enter your Mobile Number
ur: براہ مہربانی اپنا موبائل نمبر درج کریں

source: Password *
ur: * پاس ورڈ

source: Please enter a Password
ur: براہ مہربانی پاس ورڈ درج کریں

source: Re-Enter Password *
ur: * پاس ورڈ کا دوبارہ اندراج کریں

source: Please re-enter the Password
ur: براہ مہربانی پاس ورڈ دوبارہ درج کریں

source: User Type *
ur: یوزر کی اقسام *

source: Please select if you are a Remitter (Sender) Or Beneficiary (Receiver) of remittance funds
ur: براہ مہربانی منتخب کریں کہ آپ رقم بھیجنے والے یا وصول کرنے والے ہیں

source: Country of Residence *
ur: * قیام کا ملک

# Full Name *
source: Full Name as per CNIC/NICOP/POC *
ur: * کے مطابق پورا نام CNIC/NICOP/POC

source: Passport Type
ur: پاسپورٹ کی قسم

source: Enter Passport Number
ur: اپنا پاسپورٹ نمبر درج کریں

source: Mobile Number *
ur: موبائل نمبر *

source: Proceed
ur: آگے بڑھیں

source: Transaction within 1 year is eligible for self awarding
ur: گذشتہ ایک سال میں کی گئ ترسیلات ذر پہ خود پوائنٹس حاصل کرنے کی سہولت ہے

source: Transaction Amount Enter exact amount as per your transaction receipt
ur: رسید پر موجود رقم عین مطابق درج کریں

source: Enter exact amount as per you transaction receipt
ur: رسید پر موجود رقم عین مطابق درج کریں

source: Date of Remittance
ur: ترسیل کی تاریخ

source: Enter date on which transaction is made
ur: وہ تاریخ درج کریں جس پر ٹرانزیکشن ہوئی

source: Dear Remitter, If you have not been awarded points against your remittance transaction automatically, please wait at least 05 working days after your remittance has been processed to self-award points.
ur: خود پوائنٹس حاصل کرنے کے لئے براہ مہربانی ٹرانزیکشن کے بعد 05 دن تک انتظار فرمائیں۔

source: For further assistance, you may contact +92-21-111-116757
ur: مزید معلومات کے لئے ہیلپ لائن پر رابطہ کریں

source: Self Award Points
ur: خود پوائنٹس حاصل کریں

source: Points Awarded
ur: پوائنٹس کا حصول کامیاب ہوا

source: Redemption Successful
ur: پوائنٹس کامیابی سے استعمال ہو چکے ہیں

source: To redeem your points for NRLP Benefits offered by FBR, please visit www.fbr.gov.pk to generate Payment Slip ID (PSID) for your selected service. If you already have a PSID,please continue.
ur: اپنے پوائنٹس کو ایف بی آر کی سروس کے لۓ استعمال کرنا ہو تو www.fbr.gov.pk پر جا کر اپنی منتخب شدہ سروس کی پی ایس آی ڈی حاصل کریں۔ پی ایس آی ڈی پہلے سے موجود ہونے کی صورت میں آگے بڑھیں

source: To redeem your points for benefits offered by PIA, please visit www.piac.com.pk to generate Payment Slip ID (PSID) for your selected service. If you already have a PSID please continue.
ur: اپنے پوائنٹس کو پی آئ اے کی سروس کے لۓ استعمال کرنا ہو تو www.piac.com.pk پر جا کر اپنی منتخب شدہ سروس کی پی ایس آی ڈی حاصل کریں۔ پی ایس آی ڈی پہلے سے موجود ہونے کی صورت میں آگے بڑھیں

source: Enter PSID for Redemption
ur: پی ایس آئی ڈی نمبر درج کریں

source: PSID Number
ur: پی ایس آئی ڈی نمبر

source: Enter PSID
ur: پی ایس آئی ڈی نمبر درج کریں

source: Enter other Amount Here
ur: مختلف رقم ادائیگی کے لئے درج کریں

source: You have redeemed %1$@ Points against PSID %2$@ successfully at FBR
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: You have redeemed %1$@ Points against PSID %2$@ successfully at PIA
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Receipt No. %1$@ You have redeemed %2$@ Points against PSID %3$@ successfully at FBR %4$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Receipt No. %1$@ You have redeemed %2$@ Points at Passport %3$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: To redeem your points for benefits offered by NADRA, please visit www.nadra.gov.pk to generate Tracking Number for your selected service. If you already have a Tracking Number please continue.
ur: اپنے پوائنٹس کو NADRA کی سروس کے لۓ استعمال کرنا ہو تو www.nadra.gov.pk پر جا کر اپنی منتخب شدہ سروس کی ٹریکنگ نمبرحاصل کریں۔ ٹریکنگ نمبر پہلے سے موجود ہونے کی صورت میں آگے بڑھیں

source: Enter Tracking ID for Redemption
ur: ٹریکنگ آئی ڈی درج کریں

source: Tracking ID Number
ur: ٹریکنگ آئی ڈی

source: Enter CNIC for Redemption
ur: CNIC نمبر درج کریں

source: You have redeemed %1$@ Points against Tracking ID: %2$@ successfully at NADRA
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Receipt No. %1$@ You have redeemed %2$@ Points against Tracking ID %3$@ successfully at NADRA. %4$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Receipt No. %1$@ You have redeemed %2$@ Points against PSID %3$@ successfully at PIA %4$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Transaction Reference No. / TT No.
ur: ترسیل کی ٹرانزیکشن کا ٹی ٹی نمبر

source: Transactions from last one year, starting 1st Oct 2021 are eligible
ur: 1 اکتوبر 2021 کے بعد سے ایک سال پرانی ٹرانزیکشنز استعمال کی جا سکتی ہیں

source: Utility Stores
ur: یوٹیلیٹی سٹورز

source: To redeem your points for benefits at Utility Stores, please visit Utility Store outlet to get Payment Slip ID (PSID) for your purchases. If you already have a PSID please continue.
ur: اپنے پوائنٹس کو یوٹیلیٹی سٹور کی سروس کے لۓ استعمال کرنا ہو تو براہ کرم یوٹیلیٹی سٹور کی دکان پر جائیں۔ منتخب شدہ سروس کی پی ایس آی ڈی حاصل کریں۔ پی ایس آی ڈی پہلے سے موجود ہونے کی صورت میں آگے بڑھیں

source: You have redeemed %1$@ Points against PSID %2$@ successfully at Utility Stores
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Receipt No. %1$@ You have redeemed %2$@ Points against PSID %3$@ successfully at Utility Stores. %4$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Voucher Number
ur: واؤچر نمبر

source: Enter Voucher No
ur: واؤچر نمبر درج کریں

source: Receipt No. %1$@ Your amount against Voucher No. %2$@ for %3$@ Points is redeemed successfully at OPF %4$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Enter your State Life Policy No.
ur: اپنی اسٹیٹ لائف پالیسی نمبر درج کریں

source: Policy Number
ur: پالیسی نمبر

source: Enter Policy No
ur: پالیسی نمبر درج کریں

source: Receipt No. %1$@ You have redeemed %2$@ Points against Policy No. %3$@ successfully at State Life. %4$@
ur: آپ نے %3$@ پی ایس آئی ڈی کے عوض %1$@ پر %2$@ پوائنٹس بمورخہ %4$@ استعمال کر لئے ہیں۔

source: Redeem your points
ur: پوائنٹس استعمال کریں

source: MEMBER SINCE
ur: رکنیت کا آغاز

source: Your loyalty points
ur: آپ کے لوائلٹی پوائنٹس

source: Annual Remittance to-date
ur: مجموعی سالانہ ترسیل (امریکی ڈالر)

source: The Annual Remittance to-date in USD is accumulated from 1st July of each year, and your loyalty category calculated based on this. For further details please visit FAQs
ur: سالانہ ترسیل کی مجموعی ڈالر میں رقم کا تعین ہر سال یکم جولائی سے تیس جون تک کیا جاتا ہے، اور آپ کی لوائلٹی کے زمرے کا تعین بھی اس پر مبنی ہے۔ مزید معلومات کے لئے مقرر پوچھے گئے سوالات ملاحظہ کریں۔

# Enter Reference Number/TT Number as per your transaction receipt
source: Please enter the Transaction Reference No/ TT No, appearing on Remittance Receipt
ur: براہ کرم ٹرانزیکشن رسید پر موجود ریفرنس نمبر/ ٹی ٹی نمبر درج کریں

source: Enter your remittance transaction reference number. Note: (Current year Transaction can only be used for registration, applicable from 1st Oct 2021)
ur: اپنی ترسیلات کا حوالہ نمبر درج کریں نوٹ: صرف موجودہ سال کیی ٹرانزیکشن رجسٹریشن کے لیے استعمال کی جاسکتی ہے ، یکم اکتوبر 2021 سے نافذ العمل ہے

source: PKR
ur: پاکستانی روپیہ

# transactionNotFoundError
source: Dear Customer, your provided details do not match with our records, kindly enter correct information or contact us at Customer Support at +92-21-111-11-6757 or email us at sdrpsupport@1link.net.pk
ur: معزز صارف, آپ کی فراہم کردہ تفصیلات ہمارے ریکارڈ میں موجود نہیں ہیں، برائے مہربانی درست معلومات درج کریں یا کسٹمر سپورٹ پر ہم سے رابطہ کریں +92-21-111-11-6757 یا ہمیں پر sdrpsupport@1link.net.pk ای میل کریں۔

source: View Sohni Dharti Remittance Program Benefits
ur: سوہنی دھرتی ریمیٹینس پروگرام کے فوائد دیکھیں

source: Enter your remittance transaction reference number. Note: (Current year Transaction can only be used for Self-Awarding, applicable from 1st Oct 2021)
ur: اپنی ترسیلات کا حوالہ نمبر درج کریں نوٹ: خود پوائنٹس حاصل کرنے کے لیے صرف موجودہ سال کیی ٹرانزیکشن ہی استعمال کی جاسکتی ہے ، یکم اکتوبر 2021 سے نافذ العمل ہے

# Enter Beneficiary Account Number/ IBAN/CNIC on which remittance is sent
source: Please enter following details of remittance receiver in Pakistan 1. In case of receiving cash-CNIC 2. In case of credits in bank account-complete bank account no.
ur: پاکستان میں ترسیلات زر وصول کرنے والے کی درج ذیل تفصیلات درج کریں 1. نقد وصول کرنے کی صورت میں : قومی شناختی کارڈ نمبر 2. بینک اکاؤنٹ میں کریڈٹ کی صورت میں: مکمل بینک اکاؤنٹ نمبر

# Beneficiary Account Number/ IBAN/CNIC
source: Beneficiary Account Number/IBAN/CNIC/POC
ur: وصول کنندہ کا اکاونٹ نمر/ بین الاقوامی بینک اکاؤنٹ نمبر/قومی شناختی کارڈ نمر

# CNIC/NICOP Issuance Date *
source: CNIC/NICOP/POC Issuance Date *
ur: * کے اجراء کی تاریخ CNIC/NICOP/POC

source: Place of Birth *
ur: جائے پیدائش *

source: Mother Maiden Name *
ur: ماں کا نام *

source: Guide
ur: رہنمائی کے لئے

source: We have sent you OTP on your registered mobile number, please enter the OTP below
ur: ہم نے رجسٹرڈ فون نمبر پر آپ کو او ٹی پی بھیجا ہے۔ براہ کرم نیچے او ٹی پی درج کریں

# CNIC/NICOP Issuance Date
source: CNIC/NICOP/POC Issuance Date
ur: کے اجراء کی تاریخ CNIC/NICOP/POC

source: Place of Birth
ur: جائے پیدائش

source: Mother Maiden Name
ur: ماں کا نام

source: Dear Customer, Your NADRA Verification is required to proceed further. Please click accept for verification
ur: مزید آگے بڑھنے کے لئے آپ کی NADRA تصدیق درکار ہے۔ تصدیق کے لیے قبول کریں

source: Accept
ur: قبول کریں

source: Without providing verification, you will not be able to login Are you sure, you want to exit the Application?
ur: تصدیق فراہم کیے بغیر، آپ لاگ ان نہیں کر سکیں گے کیا آپ کو یقین ہے، آپ باہر نکلنا چاہتے ہیں

# Please enter a valid CNIC/NICOP Issue Date
source: Please enter a valid CNIC/NICOP/POC Issue Date
ur: اجراء ی تاریخ درست درج ی CNIC/NICOP/POC

source: NADRA Verification
ur: NADRA تصدیق
